app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 0]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
---
  def index
    if params[:artist_id]
      begin
        @artist = Artist.find(params[:artist_id])
        @songs = @artist.songs
      rescue ActiveRecord::RecordNotFound
        flash[:notice] = "Artist not found."
        redirect_to artists_path
      end
    else
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 12345]]
---
  def show
    if params[:artist_id]
      begin
        @artist = Artist.find(params[:artist_id])
        @song = @artist.song.find(params[:id])